import {I18nManager} from 'react-native'

I18nManager.isRTL ?
        obj = {
            title: 'בנלי TRK502X במבחן דרכים',
            subtitle: 'אחרי שרכבנו על הגרסה הרגילה, מגיעה זו המשפרת את תחום השטח ומוסיפה אבזור. האם יש לדגם ה-X את מה שצריך בשביל לתת פייט לגדולים ממנו? ',
            carTitle1: 'גולף GTI פרפורמנס במבחן',
            carSubtitle1: `גרסת הפרפורמנס של הדור השביעי של הגולף GTI עשתה עליה שקטה (תרתי משמע) לארצנו. האם תוספת הסוסים הצנועה תעזור לה להתמודד מול ההוט-האצ' שמורידות היום לזוג הגלגלים הקדמיים קרוב ל-300 כוחות סוס, או שאולי הגולף פונה בכלל לקהל יעד אחר?`,
            longSubtitle: `"בנלי העתיקו את ה-GS והמולטיסטרדה!" – זעקו כותרות האתרים כשתמונות ראשונות של ה-TRK החלו לדלוף לרשת. וזאת התגלתה כמחמאה, מדובר באופנוע אדוונצ'ר בגודל אמיתי, שגם נראה ממש מרשים. היצרנית האיטלקית מציעה קשת דגמים רחבה, עכשיו מחזקת החברה את סגמנט האדוונצ'ר ומוסיפה דגם בעל אוריינטציית שטח ואבזור נוסף, אותו נבחן כאן בכתבה. בחבילה טובה עם תג מחיר אטרקטיבי במיוחד. שני הדגמים זהים למעשה כמעט לחלוטין, אך ה-X בעל חישוקי שפיצים, גלגל 19 אינץ' קדמי, ומיגון גחון אמור לקרוץ גם לאלו המעדיפים את האדוונצ'ר שלהם מתובל במנת אבק וזיעה.
בשטח, ה-502X נמצא בצד הרך יותר של סקאלת היכולות. עם בולמים רכים יחסית וכוח מנוע מוגבל, יהיה לו קשה יותר להתמודד עם אתגרים קשוחים. אם תרצו לדחוף את ה-502X אל המגבלות ומעבר, תצטרכו לפחות להחליף לצמיגי דו"ש קרביים. ה-502X מגיע מצויד במגיני מנוע, ידיים, גחון, שקע USB, ג'ק אמצע ובסבל מקורי. את ה-ABS ניתן לנתק ואת כיסוי הגומי שעל הרגליות אפשר וכדאי לפרק. למרות היותו אדוונצ'ר פחות נוח לעמוד עליו משציפינו.
מערך המתלים של ה-502X כולל מזלג הפוך בקוטר 50 מ"מ עם מהלך מתלה של 135 מ"מ מקדימה, מאחורה מונושוק עם מהלך של 145 מ"מ ואפשרות לכיוון שיכוך כיווץ, החזרה ועומס קפיץ. אין מה לצפות כאן לאיזו פסקה שמהללת את ביצועי המתלים בשטח – הם מתפקדים טוב, גם כאשר לוחצים את ה-X מעט יותר, ומספקים ביצועים סבירים שעומדים בקנה אחד עם ייעודו ויכולותיו של האופנוע.`,
            longCarSubtitle1: `פולקסווגן גולף GTI היא אחת המכוניות המפורסמות של תעשיית הרכב, אגדה בחייה מאז שלהי שנות ה-70, עובדה שמסייעת לה ללא ספק מבחינה תדמיתית-שיווקית. אם בעבר היו לה שתיים-שלוש מתחרות, היום המספר גדול פי כמה. אפילו אצלנו, בשוק המוגבל ועם מחירי רכב גבוהים להחריד, אלה לא רק יריבות מסורתיות מבית פיז'ו ורנו. יש גם תוצרת יפן וקוריאה בדמות הונדה ויונדאי, יש מתחרות מבית כמו סיאט לאון קופרה שהפכה לרבת מכר בשוק המקומי.
בפעם האחרונה בה נהגנו בגולף GTI (לאחר מתיחת פנים), ציינו כי חבל שהיבואנית אינה משווקת כאן את גרסת פרפורמנס, עם ביצועים ויכולת דינמית משופרת שתסייע לה להיות עוד יותר טובה ומעניינת. ועכשיו זה קורה. לא מכיוון שבצ'מפיון מוטורס האזינו לנו ברוב קשב, אלא מסיבה טובה הרבה יותר - ה-GTI המוכרת בגרסתה הרגילה אינה מיוצרת עוד, מהלך שמכין את הקרקע לקראת החלפתה הקרובה מאוד. את הפרפורמנס כן מייצרים עדיין, או שפולקסווגן מחזיקה במלאי גדול שצריך לחסל ובהתאם, מחירו (עבור היבואנית) נמוך מבעבר. כך או אחרת - היא כאן וזו סיבה מצוינת למבחן בזק שמטרתו לגלות האם היא עדיין מעניינת כשהייתה.
מלפנים (340 במקום 312 מ"מ) ומאחור (310 מאווררים במקום 300 מ"מ), צביעה אדומה-קרבית לקאליפרים וצמיגי ברידגסטון פוטנזה S001 דביקים על חישוקי "18 מושחרים ונאים במקום ברידג'סטון טורנזה "רגועים" יותר על חישוקי "17. לסיום, בקרת היציבות ניתנת לניתוק מלא במקום חלקי ותחשבו על התועלת לכך במסלול.
נשמע כמו שיפור קל? הוא מורגש ומשמעותי ואחראי ליכולת דינמית - פנייה, האצה ובלימה - עדיפה בבירור, לצד נהיגה מהנה יותר. נוחות הנסיעה לעומת זאת פחות טובה, בעיקר בספיגת שיבושים עירוניים. לצמיגים נמוכי חתך וחישוקים גדולים יש אחריות לכך, אך גם לכיול נוקשה (מדי) של מערך המתלים. בולמי זעזועים אדפטיביים המוצעים כציוד תקני בסיאט לאון קופרה למשל, היו יכולים לפתור זאת. בפולקסווגן, כמו בפולקסווגן, תדרשו לשלם על כך תוספת של 8,500 שקלים.`
        } : 
        obj = {
            title: 'Benelli TRK502X Road Test',
            subtitle: 'Benelli’s TRK 502X is always game, no matter what two-wheeled adventures you have in mind. Designed to conquer almost every riding condition known to man or motorcycle, the TRK 502X has the capability of tackling dirt, sand and tarmac with similar prowess.',
            carTitle1: 'Golf GTI Performance Test',
            carSubtitle1: 'The Golf GTI’s 242bhp figure might sound a little bit conservative in 2019, especially as rivals punch significantly harder, with lower price tags. So does the Golf GTI feel in any way slow?',
        
        };
        obj['trk502x'] = 'https://www.doogri.co.il/wp-content/uploads/2019/05/IMG_3018.jpg'
        obj['golfgti'] = 'https://www.doogri.co.il/wp-content/uploads/2019/06/IMG_3182_B.jpg'

export default obj;
